c5/src/DataProcessors/RetailSales/RetailSales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>RetailSales</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Day</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

c5/src/DataProcessors/RetailSales/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )

	init ();

EndProcedure

&AtServer
Procedure init ()
	
	settings = Logins.Settings ( "Company, Warehouse, Department, PaymentLocation" );
	Object.Company = settings.Company;
	Object.Warehouse = settings.Warehouse;
	Object.Department = settings.Department;
	Object.Location = settings.PaymentLocation;
	Object.Day = BegOfDay ( CurrentSessionDate () );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	if ( CheckFilling () ) then
		NotifyChoice ( data () );
	endif;

EndProcedure

&AtClient
Function data ()
	
	result = new Structure ();
	result.Insert ( "Company", Object.Company );
	result.Insert ( "Day", Object.Day );
	result.Insert ( "Department", Object.Department );
	result.Insert ( "Location", Object.Location );
	result.Insert ( "Method", Object.Method );
	result.Insert ( "Warehouse", Object.Warehouse );
	result.Insert ( "Memo", Object.Memo );
	return result;

EndFunction
